Repository: GE-Developer/VOID
Catalog: VOID/Resources/Localizable.xcstrings
Source language: en
Languages: ar, az, be, bn, ca, cs, da, de, el, es, fi, fr, he, hi, hr, hu, hy, id, is, it, ja, ka, kk, ko, ky, ms, nb, nl, pl, pt, ro, ru, sk, sv, th, tr, uk, vi, zh_hans, zh_hant

# CryptoSettings.Security.Void.instructions
source: **VOID enhances the cryptographic key** by adding a hidden internal component. A value of 0 means encryption is performed without VOID. **The VOID number only affects the variant selection**, not the level of protection.
ar: **يعزز VOID المفتاح التشفيري** بإضافة مكوّن داخلي مخفي. قيمة 0 تعني إجراء التشفير بدون VOID. **رقم VOID يؤثر فقط على اختيار المتغير**، وليس على مستوى الحماية.
az: **VOID gizli daxili komponent əlavə etməklə kriptoqrafik açarı gücləndirir.** 0 dəyəri şifrələmənin VOID olmadan aparıldığını göstərir. **VOID nömrəsi yalnız variant seçiminə təsir edir**, qoruma səviyyəsinə yox.
be: **VOID умацоўвае крыптаграфічны ключ**, дадаючы схаваны ўнутраны кампанент. Значэнне 0 азначае, што шыфраванне выконваецца без VOID. **Нумар VOID уплывае толькі на выбар варыянту**, але не на ўзровень абароны.
bn: **VOID ক্রিপ্টোগ্রাফিক কী উন্নত করে** একটি লুকানো অভ্যন্তরীণ উপাদান যোগ করে। 0 মান মানে VOID ছাড়াই এনক্রিপশন সম্পাদিত হয়। **VOID নম্বর শুধুমাত্র বৈচিত্র্য নির্বাচনকে প্রভাবিত করে**, সুরক্ষার মাত্রাকে নয়।
ca: **VOID reforça la clau criptogràfica** afegint un component intern ocult. Un valor de 0 significa que el xifrat es fa sense VOID. **El número VOID només afecta la selecció de la variant**, no el nivell de protecció.
cs: **VOID posiluje kryptografický klíč** přidáním skryté vnitřní součásti. Hodnota 0 znamená, že šifrování probíhá bez VOIDu. **Číslo VOID ovlivňuje pouze výběr varianty**, nikoli úroveň ochrany.
da: **VOID styrker den kryptografiske nøgle** ved at tilføje en skjult intern komponent. 0 betyder, at kryptering udføres uden VOID. **VOID-nummeret påvirker kun valg af variant**, ikke beskyttelsesniveauet.
de: **VOID verstärkt den kryptografischen Schlüssel**, indem es eine versteckte interne Komponente hinzufügt. Der Wert 0 bedeutet, dass ohne VOID verschlüsselt wird. **Die VOID-Nummer beeinflusst nur die Variantenwahl**, nicht das Schutzniveau.
el: Το **VOID ενισχύει το κρυπτογραφικό κλειδί** προσθέτοντας ένα κρυφό εσωτερικό στοιχείο. 0 σημαίνει ότι η κρυπτογράφηση γίνεται χωρίς VOID. **Ο αριθμός VOID επηρεάζει μόνο την επιλογή παραλλαγής**, όχι το επίπεδο προστασίας.
es: **VOID refuerza la clave criptográfica** al añadir un componente interno oculto. Un valor de 0 significa que el cifrado se realiza sin VOID. **El número de VOID solo afecta a la selección de la variante**, no al nivel de protección.
fi: **VOID vahvistaa kryptografista avainta** lisäämällä piilotetun sisäisen komponentin. 0 tarkoittaa, että salaus tehdään ilman VOIDia. **VOID-numero vaikuttaa vain variantin valintaan**, ei suojauksen tasoon.
fr: **VOID renforce la clé cryptographique** en ajoutant une composante interne cachée. Une valeur de 0 signifie que le chiffrement est effectué sans VOID. **Le numéro VOID influence uniquement le choix de la variante**, et non le niveau de protection.
he: **VOID משפר את המפתח הקריפטוגרפי** על ידי הוספת רכיב פנימי נסתר. ערך 0 משמעו שההצפנה מבוצעת ללא VOID. **מספר ה-VOID משפיע רק על בחירת הגרסה**, לא על רמת ההגנה.
hi: **VOID एक छिपा हुआ आंतरिक घटक जोड़कर क्रिप्टोग्राफ़िक कुंजी को बढ़ाता है। मान 0 होने पर एन्क्रिप्शन VOID के बिना किया जाता है। VOID संख्या केवल वेरिएंट चयन को प्रभावित करती है, सुरक्षा के स्तर को नहीं।**
hr: **VOID pojačava kriptografski ključ** dodavanjem skrivenog internog elementa. Vrijednost 0 znači da se šifriranje izvodi bez VOID-a. **Broj VOID utječe samo na odabir varijante**, ne na razinu zaštite.
hu: A **VOID megerősíti a kriptográfiai kulcsot** egy rejtett belső komponens hozzáadásával. 0 érték esetén a titkosítás VOID nélkül történik. **A VOID szám csak a variáns kiválasztását befolyásolja**, a védelem szintjét nem.
hy: **VOID-ը գաղտնաբառին ավելացնում է ներքին գաղտնի բաղադրիչ և ուժեղացնում է կրիպտոգրաֆիկ բանալին.** 0 արժեքը նշանակում է, որ կոդավորումը կատարվում է առանց VOID-ի. **VOID-ի համար ընտրված թիվը ազդում է միայն տարբերակի վրա**, ոչ թե պաշտպանության մակարդակի.
id: **VOID memperkuat kunci kriptografis** dengan menambahkan komponen internal tersembunyi. 0 berarti enkripsi dilakukan tanpa VOID. **Angka VOID hanya memengaruhi pemilihan varian**, bukan tingkat perlindungan.
is: **VOID styrkir kryptógrafískan lykil** með því að bæta við falinni innri einingu. 0 þýðir að dulkóðun fer fram án VOID. **VOID-númerið hefur aðeins áhrif á val á afbrigði**, ekki á verndarstig.
it: **VOID rafforza la chiave crittografica** aggiungendo una componente interna nascosta. Un valore pari a 0 significa che la cifratura viene eseguita senza VOID. **Il numero VOID influisce solo sulla scelta della variante**, non sul livello di protezione.
ja: **VOID は隠された内部コンポーネントを加えることで暗号鍵を強化**します。 0 の値は、VOID なしで暗号化が行われることを意味します。 **VOID の数値はバリアントの選択にのみ影響し**、保護レベルは変わりません。
ka: **VOID აძლიერებს კრიპტოგრაფიულ გასაღებ კოდს**, რადგან მას დამატებით დამალულ შიდა კომპონენტს უმატებს. 0 ნიშნავს, რომ შიფრაცია VOID-ის გარეშე სრულდება. **VOID-ის ნომერი მხოლოდ ვარიანტის არჩევას განსაზღვრავს** და არა დაცვის დონეს.
kk: **VOID жасырын ішкі компонент қосу арқылы криптографиялық кілтті жақсартады**. 0 мәні шифрлаудың VOID-сіз орындалатынын білдіреді. **VOID нөмірі тек нұсқа таңдауына әсер етеді**, қорғаныс деңгейіне емес.
ko: **VOID는 숨겨진 내부 구성 요소를 추가하여 암호 키를 강화**합니다。 값이 0이면 VOID 없이 암호화를 수행함을 의미합니다。 **VOID 번호는 변형 선택에만 영향을 미치며**, 보호 수준은 바꾸지 않습니다。
ky: **VOID жашырын ички компонент кошуу аркылуу криптографиялык ачкычты жакшыртат**. 0 мааниси шифрлөөнүн VOID сиз аткарылаарын билдирет. **VOID номери вариант тандоосуна гана таасир этет**, коргоо деңгээлине эмес.
ms: **VOID mengukuhkan kunci kriptografi** dengan menambah komponen dalaman tersembunyi. 0 bermakna penyulitan dilakukan tanpa VOID. **Nombor VOID hanya mempengaruhi pemilihan varian**, bukan tahap perlindungan.
nb: **VOID forsterker den kryptografiske nøkkelen** ved å legge til en skjult intern komponent. 0 betyr at kryptering utføres uten VOID. **VOID-nummeret påvirker kun valg av variant**, ikke sikkerhetsnivået.
nl: **VOID versterkt de cryptografische sleutel** door een verborgen interne component toe te voegen. Een waarde van 0 betekent dat er wordt versleuteld zonder VOID. **Het VOID-nummer beïnvloedt alleen de variantkeuze**, niet het beschermingsniveau.
pl: **VOID wzmacnia klucz kryptograficzny** poprzez dodanie ukrytego wewnętrznego komponentu. 0 oznacza, że szyfrowanie odbywa się bez VOID. **Numer VOID wpływa jedynie na wybór wariantu**, nie na poziom ochrony.
pt: **O VOID reforça a chave criptográfica** adicionando um componente interno oculto. Um valor 0 significa que a criptografia é realizada sem VOID. **O número do VOID apenas afeta a escolha da variante**, não o nível de proteção.
ro: **VOID întărește cheia criptografică** adăugând o componentă internă ascunsă. 0 înseamnă că criptarea se face fără VOID. **Numărul VOID influențează doar alegerea variantei**, nu și nivelul de protecție.
ru: **VOID усиливает криптографический ключ**, добавляя к нему скрытый внутренний компонент. Значение 0 означает, что шифрование выполняется без VOID. **Номер VOID влияет только на выбор варианта**, но не изменяет уровень защиты.
sk: **VOID posilňuje kryptografický kľúč** pridaním skrytej internej zložky. 0 znamená, že šifrovanie prebieha bez VOID-u. **Číslo VOID ovplyvňuje iba výber variantu**, nie úroveň ochrany.
sv: **VOID förstärker den kryptografiska nyckeln** genom att lägga till en dold intern komponent. Värdet 0 betyder att krypteringen utförs utan VOID. **VOID-numret påverkar bara variantvalet**, inte skyddsnivån.
th: **VOID ช่วยเสริมความแข็งแรงให้คีย์เข้ารหัส** ด้วยการเพิ่มส่วนประกอบภายในที่ซ่อนอยู่. 0 หมายถึงการเข้ารหัสจะดำเนินการโดยไม่มี VOID. **ตัวเลข VOID มีผลเพียงการเลือกรูปแบบ** ไม่ได้เพิ่มระดับการป้องกัน.
tr: **VOID, gizli bir iç bileşen ekleyerek kriptografik anahtarı güçlendirir**. Değer 0 ise şifreleme VOID olmadan gerçekleştirilir. **VOID sayısı sadece varyant seçimini etkiler**, korunma seviyesini değiştirmez.
uk: **VOID посилює криптографічний ключ**, додаючи прихований внутрішній компонент. 0 означає, що шифрування виконується без VOID. **Номер VOID впливає лише на вибір варіанта**, а не на рівень захисту.
vi: **VOID tăng cường khóa mật mã** bằng cách thêm thành phần nội bộ ẩn. Giá trị 0 có nghĩa là mã hóa được thực hiện mà không có VOID. **Số VOID chỉ ảnh hưởng đến việc chọn biến thể**, không thay đổi mức bảo vệ.
zh_hans: **VOID 通过加入隐藏的内部组件来增强密钥**。 当数值为 0 时，表示在没有 VOID 的情况下进行加密。 **VOID 数字只影响变体选择**，不会改变防护等级。
zh_hant: **VOID 透過加入隱藏的內部元件來增強金鑰**。 當數值為 0 時，表示在沒有 VOID 的情況下進行加密。 **VOID 數字隻影響變體選擇**，不會改變防護等級。

# CryptoSettings.Security.Void.subtitle
source: Secret
ar: سري
az: Gizli
be: Сакрэт
bn: গোপন
cs: Tajné
da: Hemmelighed
de: Geheimnis
el: Μυστικό
es: Secreto
fi: Salaisuus
he: סודי
hi: गुप्त
hr: Tajna
hu: Titok
hy: Գաղտնի
id: Rahasia
is: Leyndarmál
it: Segreto
ja: 秘密
ka: საიდუმლო
kk: Құпия
ko: 비밀
ky: Сыр
ms: Rahsia
nb: Hemmelig
nl: Geheim
pl: Sekret
pt: Segredo
ru: Секрет
sk: Tajomstvo
sv: Hemlighet
th: ความลับ
tr: Gizli
uk: Секрет
vi: Bí mật
zh_hans: 密钥
zh_hant: 金鑰

# CryptoSettings.strong
source: Strong
ar: قوي
az: Güclü
be: Моцны
bn: শক্তিশালী
ca: Fort
cs: Silné
da: Stærk
de: Stark
el: Ισχυρό
es: Fuerte
fi: Vahva
fr: Fort
he: חזק
hi: मजबूत
hr: Snažno
hu: Erős
hy: Ուժեղ
id: Kuat
is: Sterkt
it: Forte
ja: 強力
ka: ძლიერი
kk: Күшті
ko: 강함
ky: Күчтүү
ms: Kuat
nb: Sterk
nl: Sterk
pl: Silne
pt: Forte
ro: Puternic
ru: Сильно
sk: Silné
sv: Starkt
th: แข็งแรง
tr: Güçlü
uk: Сильно
vi: Mạnh
zh_hans: 强
zh_hant: 強

# CryptoSettings.Timer.instuctions
source: **Data becomes inaccessible** after the chosen time.
ar: **تصبح البيانات غير قابلة للوصول** بعد الوقت المحدد.
az: **Məlumat seçilən vaxtdan sonra əlçatmaz olur.**
be: **Даныя становяцца недаступнымі** пасля абранага часу.
bn: **ডেটা অ্যাক্সেসযোগ্য হয় না** নির্বাচিত সময়ের পরে।
ca: **Les dades es tornen inaccessibles** després del temps seleccionat.
cs: **Data se po zvoleném čase stanou nedostupná**.
da: **Data bliver utilgængelige** efter den valgte tid.
de: **Nach der gewählten Zeit werden die Daten unzugänglich**.
el: **Τα δεδομένα γίνονται μη προσβάσιμα** μετά τον επιλεγμένο χρόνο.
es: Los **datos se vuelven inaccesibles** después del tiempo seleccionado.
fi: **Data muuttuu saavuttamattomaksi** valitun ajan jälkeen.
fr: Les **données deviennent inaccessibles** après le temps choisi.
he: **הנתונים הופכים לבלתי נגישים** לאחר הזמן שנבחר.
hi: चुने गए समय के बाद **डेटा अप्राप्य हो जाता है**।
hr: **Podaci postaju nedostupni** nakon odabranog vremena.
hu: **Az adatok a kiválasztott idő után elérhetetlenné válnak.**
hy: **Տվյալները ընտրված ժամանակից հետո դառնում են անհասանելի.**
id: **Data menjadi tidak dapat diakses** setelah waktu yang dipilih.
is: **Gögnin verða óaðgengileg** eftir valinn tíma.
it: **I dati diventano inaccessibili** dopo il tempo scelto.
ja: **データは選択した時間後にアクセスできなくなります**。
ka: **მონაცემები ვერ იქნება ხელმისაწვდომი** შერჩეული დროის გასვლის შემდეგ.
kk: Таңдалған уақыттан кейін **деректер қолжетімсіз болады**.
ko: 선택한 시간이 지나면 **데이터에 접근할 수 없습니다**。
ky: Тандалган убакыттан кийин **маалыматтар жеткиликсиз болот**.
ms: **Data menjadi tidak dapat diakses** selepas tempoh yang dipilih.
nb: **Data blir utilgjengelig** etter tiden du velger.
nl: **Gegevens worden ontoegankelijk** na de gekozen tijd.
pl: **Dane stają się niedostępne** po wybranym czasie.
pt: **Os dados se tornam inacessíveis** após o tempo escolhido.
ro: **Datele devin inaccesibile** după timpul ales.
ru: **Данные становятся недоступными** после выбранного времени.
sk: **Dáta sa stanú nedostupnými** po zvolenom čase.
sv: **Data blir otillgängliga** efter den valda tiden.
th: **ข้อมูลจะไม่สามารถเข้าถึงได้** หลังจากเวลาที่ตั้งไว้.
tr: Seçilen süreden sonra **verilere erişilemez**.
uk: **Дані стають недоступними** після обраного часу.
vi: **Dữ liệu sẽ không thể truy cập** sau khoảng thời gian đã chọn.
zh_hans: 所选时间过后，**数据将变为不可访问**。
zh_hant: 所選時間過後，**資料將變為不可訪問**。

# CryptoSettings.Timer.subtitle
source: Set Timer
ar: ضبط المؤقت
az: Taymeri qur
be: Усталяваць таймер
bn: টাইমার সেট করুন
ca: Configura el temporitzador
cs: Nastavte časovač
da: Indstil timer
de: Timer einstellen
el: Ρύθμιση χρονοδιακόπτη
es: Establecer temporizador
fi: Aseta ajastin
fr: Définir le minuteur
he: הגדר טיימר
hi: टाइमर सेट करें
hr: Postavi mjerač vremena
hu: Időzítő beállítása
hy: Կարգավորեք ժամաչափը
id: Setel Pengatur Waktu
is: Stilltu tímamæli
it: Imposta timer
ja: タイマーを設定
ka: დააყენეთ ტაიმერი
kk: Таймер орнату
ko: 타이머 설정
ky: Таймер коюу
ms: Tetapkan Pemasa
nb: Still inn timer
nl: Timer instellen
pl: Ustaw timer
pt: Definir temporizador
ro: Setează timerul
ru: Установить таймер
sk: Nastav časovač
sv: Ställ in timer
th: ตั้งเวลา
tr: Zamanlayıcı ayarla
uk: Встановити таймер
vi: Đặt hẹn giờ
zh_hans: 设置计时
zh_hant: 設定計時

# CryptoSettings.Timer.title
source: Timer
ar: المؤقت
az: Taymer
be: Таймер
bn: টাইমার
ca: Temporitzador
cs: Časovač
el: Χρονοδιακόπτης
es: Temporizador
fi: Ajastin
fr: Minuteur
he: טיימר
hi: टाइमर
hr: Mjerač vremena
hu: Időzítő
hy: Ժամաչափ
id: Pengatur Waktu
is: Tímamælir
ja: タイマー
ka: ტაიმერი
kk: Таймер
ko: 타이머
ky: Таймер
ms: Pemasa
pt: Temporizador
ru: Таймер
sk: Časovač
th: ตัวจับเวลา
tr: Zamanlayıcı
uk: Таймер
vi: Hẹn giờ
zh_hans: 计时
zh_hant: 計時

# CryptoSettings.weak
source: Weak
ar: ضعيف
az: Zəif
be: Слабы
bn: দুর্বল
ca: Feble
cs: Slabé
da: Svag
de: Schwach
el: Αδύναμο
es: Débil
fi: Heikko
fr: Faible
he: חלש
hi: कमजोर
hr: Slabo
hu: Gyenge
hy: Թույլ
id: Lemah
is: Veikt
it: Debole
ja: 弱い
ka: სუსტი
kk: Әлсіз
ko: 약함
ky: Алсыз
ms: Lemah
nb: Svak
nl: Zwak
pl: Słabe
pt: Fraco
ro: Slab
ru: Слабо
sk: Slabé
sv: Svagt
th: อ่อน
tr: Zayıf
uk: Слабо
vi: Yếu
zh_hans: 弱
zh_hant: 弱

# EmojiCoding.headerText
source: Encoding text into emojis is a **visual representation of data**, similar to Base64. **It does not provide cryptographic protection**. It can be combined with encryption for stronger security.
ar: ترميز النص إلى إيموجي هو **تمثيل بصري للبيانات**، مشابه لـ Base64. **لا يوفر حماية تشفيرية**. يمكن دمجه مع التشفير لأمان أقوى.
az: Mətni emoji-lərə kodlaşdırmaq **məlumatın vizual təqdimatıdır**, Base64-ə bənzəyir. **Kriptoqrafik mühafizə təmin etmir**. Daha güclü qorunma üçün şifrələmə ilə birlikdə istifadə oluna bilər.
be: Кадаванне тэксту ў эмодзі — гэта **візуальнае прадстаўленне даных**, падобнае да Base64. **Яно не забяспечвае крыптаграфічнай абароны**. Яго можна спалучаць з шыфраваннем для большай бяспекі.
bn: ইমোজিতে টেক্সট এনকোড করা **ডেটার একটি দৃশ্যমান উপস্থাপনা**, Base64-এর মতো। **এটি ক্রিপ্টোগ্রাফিক সুরক্ষা প্রদান করে না**। শক্তিশালী নিরাপত্তার জন্য এটি এনক্রিপশনের সাথে একত্রিত করা যায়।
ca: Codificar text en emojis és una **representació visual de les dades**, similar a Base64. **No ofereix protecció criptogràfica**. Es pot combinar amb xifratge per aconseguir més seguretat.
cs: Kódování textu do emoji je **vizuální reprezentace dat**, podobně jako Base64. **Neposkytuje kryptografickou ochranu**. Lze jej kombinovat se šifrováním pro vyšší bezpečnost.
da: At kode tekst til emojis er en **visuel repræsentation af data**, ligesom Base64. **Det giver ingen kryptografisk beskyttelse**. Det kan kombineres med kryptering for at øge sikkerheden.
de: Text in Emojis zu codieren ist eine **visuelle Darstellung von Daten**, ähnlich wie Base64. **Es bietet keinen kryptografischen Schutz**. Es kann mit Verschlüsselung kombiniert werden, um die Sicherheit zu erhöhen.
el: Η κωδικοποίηση κειμένου σε emoji είναι μια **οπτική αναπαράσταση δεδομένων**, παρόμοια με το Base64. **Δεν παρέχει κρυπτογραφική προστασία**. Μπορεί να συνδυαστεί με κρυπτογράφηση για μεγαλύτερη ασφάλεια.
es: Codificar texto en emojis es una **representación visual de datos**, similar a Base64. **No proporciona protección criptográfica**. Se puede combinar con cifrado para mayor seguridad.
fi: Tekstin koodaaminen emojeiksi on **datan visuaalinen esitys**, kuten Base64. **Se ei tarjoa kryptografista suojaa**. Sen voi yhdistää salaukseen paremman turvallisuuden saavuttamiseksi.
fr: Encoder du texte en emojis est une **représentation visuelle des données**, similaire à Base64. **Cela ne fournit pas de protection cryptographique**. Il peut être combiné avec le chiffrement pour une sécurité renforcée.
he: קידוד טקסט לאמוג'י הוא **ייצוג חזותי של נתונים**, דומה ל-Base64. **הוא אינו מספק הגנה קריפטוגרפית**. ניתן לשלב אותו עם הצפנה לאבטחה חזקה יותר.
hi: टेक्स्ट को इमोजी में एन्कोड करना **डेटा का दृश्य प्रतिनिधित्व** है, Base64 के समान। **यह क्रिप्टोग्राफिक सुरक्षा प्रदान नहीं करता**। इसे मजबूत सुरक्षा के लिए एन्क्रिप्शन के साथ जोड़ा जा सकता है।
hr: Kodiranje teksta u emodžije je **vizualno predstavljanje podataka**, slično Base64. **Ne pruža kriptografsku zaštitu**. Može se kombinirati sa šifriranjem za jaču sigurnost.
hu: A szöveg emoji-vá alakítása **vizuális adatábrázolás**, hasonlóan a Base64-hez. **Nem nyújt kriptográfiai védelmet**. Titkosítással kombinálva nagyobb biztonságot adhat.
hy: Տեքստը emoji-ների մեջ կոդավորելը **տվյալների տեսողական ներկայացում է**, նման Base64-ին. **Կրիպտոգրաֆիկ պաշտպանություն չի ապահովում**. Ավելի հուսալի պաշտպանության համար այն կարող եք համատեղել կոդավորման հետ.
id: Mengodekan teks menjadi emoji adalah **representasi visual data**, mirip dengan Base64. **Ini tidak memberikan perlindungan kriptografis**. Dapat dikombinasikan dengan enkripsi untuk keamanan yang lebih kuat.
is: Að kóða texta í emoji er **sjónræn framsetning gagna**, svipuð Base64. **Það veitir enga kryptógrafíska vernd**. Hægt er að sameina hana við dulkóðun til meiri öryggis.
it: Codificare il testo in emoji è una **rappresentazione visiva dei dati**, simile a Base64. **Non fornisce protezione crittografica**. Può essere combinato con la crittografia per una maggiore sicurezza.
ja: テキストを絵文字にエンコードすることは、Base64と同様に**データを視覚的に表現する方法**です。 **これは暗号化による保護を提供しません**。 より強力なセキュリティのために暗号化と組み合わせることができます。
ka: ტექსტის ემოჯებად კოდირება **მონაცემთა ვიზუალური წარმოდგენაა**, Base64-ის მსგავსი. **ის არ უზრუნველყოფს კრიპტოგრაფიულ დაცვას**. შეიძლება გაერთიანდეს შიფრაციასთან უფრო ძლიერი უსაფრთხოებისთვის.
kk: Мәтінді эмодзиге кодтау — Base64-ке ұқсас **деректерді көрнекі ұсыну**. **Ол криптографиялық қорғауды қамтамасыз етпейді**. Оны күшті қауіпсіздік үшін шифрлаумен біріктіруге болады.
ko: 텍스트를 이모지로 인코딩하는 것은 Base64와 유사한 **데이터의 시각적 표현**입니다。 **암호화 보호를 제공하지 않습니다**。 더 강력한 보안을 위해 암호화와 결합할 수 있습니다。
ky: Текстти эмодзиге коддоо — Base64 га окшош **маалыматтарды визуалдык берүү**. **Ал криптографиялык коргоону камсыз кылбайт**. Аны күчтүү коопсуздук үчүн шифрлөө менен айкалыштырса болот.
ms: Menukarkan teks kepada emoji ialah **representasi visual data**, seakan-akan Base64. **Ia tidak menyediakan perlindungan kriptografi**. Boleh digabungkan dengan penyulitan untuk keselamatan yang lebih kukuh.
nb: Å kode tekst til emoji er en **visuell representasjon av data**, lik Base64. **Det gir ingen kryptografisk beskyttelse**. Det kan kombineres med kryptering for sterkere sikkerhet.
nl: Tekst coderen naar emoji is een **visuele representatie van gegevens**, vergelijkbaar met Base64. **Het biedt geen cryptografische bescherming**. Het kan worden gecombineerd met encryptie voor sterkere beveiliging.
pl: Kodowanie tekstu na emoji to **wizualna reprezentacja danych**, podobna do Base64. **Nie zapewnia ochrony kryptograficznej**. Można połączyć je z szyfrowaniem, aby zwiększyć bezpieczeństwo.
pt: Codificar texto em emojis é uma **representação visual de dados**, semelhante ao Base64. **Não fornece proteção criptográfica**. Pode ser combinado com criptografia para maior segurança.
ro: Codificarea textului în emoji este o **reprezentare vizuală a datelor**, similară cu Base64. **Nu oferă protecție criptografică**. Poate fi combinată cu criptarea pentru o securitate mai ridicată.
ru: Кодирование текста в эмодзи — **визуальное представление данных**, подобное Base64. **Не обеспечивает криптографической защиты**. Может использоваться совместно с шифрованием для повышения криптостойкости.
sk: Kódovanie textu do emoji je **vizuálne zobrazenie dát**, podobné Base64. **Neposkytuje kryptografickú ochranu**. Možno ho skombinovať so šifrovaním pre vyššiu bezpečnosť.
sv: Att koda text till emojis är en **visuell representation av data**, liknande Base64. **Det ger inget kryptografiskt skydd**. Det kan kombineras med kryptering för starkare säkerhet.
th: การเข้ารหัสข้อความเป็นอีโมจิเป็น **การนำเสนอข้อมูลเชิงภาพ** คล้ายกับ Base64. **มันไม่ให้การป้องกันเชิงคริปโต**. สามารถใช้ร่วมกับการเข้ารหัสเพื่อเพิ่มความปลอดภัยได้.
tr: Metni emojilere kodlamak, Base64'e benzer şekilde **verilerin görsel temsili**dir. **Kriptografik koruma sağlamaz**. Daha güçlü güvenlik için şifreleme ile birleştirilebilir.
uk: Кодування тексту у емодзі — це **візуальне подання даних**, подібне до Base64. **Це не забезпечує криптографічного захисту**. Може бути поєднано з шифруванням для більшої безпеки.
vi: Mã hóa văn bản thành emoji là **một phương pháp biểu diễn dữ liệu trực quan**, tương tự như Base64. **Nó không cung cấp bảo vệ mật mã**. Có thể kết hợp với mã hóa để tăng cường bảo mật.
zh_hans: 将文本编码为表情符号是一种**数据的可视化表示方式**，类似于 Base64。 **它不提供加密保护**。 可以与加密结合使用以增强安全性。
zh_hant: 將文本編碼為表情符號是一種**數據的可視化表示方式**，類似於 Base64。 **它不提供加密保護**。 可以與加密結合使用以增強安全性。

# EmojiMood.animals
source: Animals
ar: حيوانات
az: Heyvanlar
be: Жывёлы
bn: প্রাণী
cs: Zvířata
da: Dyr
de: Tiere
el: Ζώα
es: Animales
fi: Eläimet
fr: Animaux
he: בעלי חיים
hi: जानवर
hr: Životinje
hu: Állatok
hy: Կենդանիներ
id: Hewan
is: Dýr
it: Animali
ja: 動物
ka: ცხოველები
kk: Жануарлар
ko: 동물
ky: Жаныбарлар
ms: Haiwan
nb: Dyr
nl: Dieren
pl: Zwierzęta
pt: Animais
ro: Animale
ru: Животные
sk: Zvieratá
sv: Djur
th: สัตว์
tr: Hayvanlar
uk: Тварини
vi: Động vật
zh_hans: 动物
zh_hant: 動物

# EmojiMood.flags
source: Flags
ar: أعلام
az: Bayraqlar
be: Сцягі
bn: পতাকা
ca: Banderes
cs: Vlajky
da: Flag
de: Flaggen
el: Σημαίες
es: Banderas
fi: Liput
fr: Drapeaux
he: דגלים
hi: देश के झंडे
hr: Zastave
hu: Zászlók
hy: Դրոշներ
id: Bendera
is: Fánar
it: Bandiere
ja: 国旗
ka: დროშები
kk: Жалаулар
ko: 국기
ky: Туулар
ms: Bendera
nb: Flagg
nl: Vlaggen
pl: Flagi
pt: Bandeiras
ro: Steaguri
ru: Флаги
sk: Vlajky
sv: Flaggor
th: ธง
tr: Ülke bayrakları
uk: Прапори
vi: Quốc kỳ
zh_hans: 国旗
zh_hant: 國旗

# EmojiMood.food
source: Food
ar: طعام
az: Qidalar
be: Ежа
bn: খাবার
ca: Menjar
cs: Jídlo
da: Mad
de: Essen
el: Φαγητό
es: Comida
fi: Ruoka
fr: Nourriture
he: אוכל
hi: भोजन
hr: Hrana
hu: Ételek
hy: Սնունդ
id: Makanan
is: Matur
it: Cibo
ja: 食べ物
ka: საკვები
kk: Тамақ
ko: 음식
ky: Тамак
ms: Makanan
nb: Mat
nl: Eten
pl: Jedzenie
pt: Comida
ro: Mâncare
ru: Еда
sk: Jedlo
sv: Mat
th: อาหาร
tr: Yiyecek
uk: Їжа
vi: Đồ ăn
zh_hans: 美食
zh_hant: 美食

# EmojiMood.loveStory
source: Love
ar: حب
az: Sevgi
be: Каханне
bn: প্রেম
ca: Amor
cs: Láska
da: Kærlighed
de: Liebe
el: Αγάπη
es: Amor
fi: Rakkaus
fr: Amour
he: אהבה
hi: प्रेम
hr: Ljubav
hu: Szerelem
hy: Սեր
id: Cinta
is: Ást
it: Amore
ja: ラブストーリー
ka: სიყვარული
kk: Махаббат
ko: 사랑
ky: Сүйүү
ms: Cinta
nb: Kjærlighet
nl: Liefde
pl: Miłość
pt: Amor
ro: Dragoste
ru: Любовь
sk: Láska
sv: Kärlek
th: ความรัก
tr: Aşk
uk: Кохання
vi: Tình yêu
zh_hans: 爱情
zh_hant: 愛情

# EmojiMood.negative
source: Negative
ar: سلبي
az: Mənfi
be: Негатыўны
bn: নেতিবাচক
ca: Negatiu
cs: Negativní
da: Negativ
de: Negativ
el: Αρνητικά
es: Negativas
fi: Negatiivinen
fr: Négatif
he: שלילי
hi: नकारात्मक
hr: Negativno
hu: Negatív
hy: Բացասական
id: Negatif
is: Neikvætt
it: Negativi
ja: ネガティブ
ka: ნეგატიური
kk: Жағымсыз
ko: 부정적
ky: Терс
ms: Negatif
nb: Negativ
nl: Negatief
pl: Negatywne
pt: Negativos
ro: Negativ
ru: Негативные
sk: Negatívne
sv: Negativa
th: เชิงลบ
tr: Olumsuz
uk: Негативні
vi: Tiêu cực
zh_hans: 负面
zh_hant: 負面
